/******************************************************
//5-20:（1）增加了超声波的测量.





*******************************************************/
#include 	<STC12C5A60S2.H>
#include	<stdlib.h>
#include	<stdio.h>
#include	<string.h>

#define uchar unsigned char
#define uint unsigned int   
/************************************宏定义************************************/
#define VELOCITY_30C	3495       //30摄氏度时的声速，声速V= 331.5 + 0.6*温度； 
#define VELOCITY_23C	3453       //23摄氏度时的声速，声速V= 331.5 + 0.6*温度； 

/************************************位定义************************************/
sbit INPUT  = P2^6;                //回声接收端口,
sbit OUTPUT = P2^7;                //超声触发端口

/********************************定义变量和数组********************************/
long int distance=0;               //距离变量
uchar count;
unsigned char a[4];

/***********************************函数声明***********************************/
void PWMInit();
void PWMInit_B();




void UART1_Send_Byte(unsigned char ddata) 
{	    
	SBUF = ddata;  //写入要发送的字符
	while(!TI);    //等待发送完毕
	TI = 0;        //清发送标志   
}

void UART1_Send_String(unsigned char *str)
{
	while(*str!='\0')
	{
		UART1_Send_Byte(*str++);	
	}
} 

void UartInit(void)		//9600bps@11.0592MHz
{
	PCON=0x00;
	SCON = 0x50;		//8位数据,可变波特率
	TMOD = 0x21;			//设定定时器1为16位自动重装方式
	TL1 = 0xfa;			//设定定时初值
	TH1 = 0xfa;			//设定定时初值
	TR1 = 1;		//启动定时器1
	EA=1;			//开总中断

}
/**************************************/
void show()
{
	int ge,shi,bai;
	ge = distance%10;
	shi = distance/10%10;
	bai = distance/100%10;
	a[0] = distance/1000 +'0';
	a[1] = bai + '0';
	a[2] = shi + '0';
	a[3] = '\0';
}
/******************************************************************************/
/* 函数名称  : Delay_xMs                                                      */
/* 函数描述  : 延时函数                                                       */
/* 输入参数  : x                                                              */
/* 参数描述  : 延时时间                                                       */
/* 返回值    : 无                                                             */
/******************************************************************************/
void Delay_xMs(unsigned int x)
{
    unsigned int i,j;
    for(i = 0;i < x;i++ )
    {
        for(j = 0;j < 3;j++ )
        {
            ;
        }
    }
}	
/******************************************************************************/
/* 函数名称  : delayt                                                         */
/* 函数描述  : 延时函数                                                       */
/* 输入参数  : x                                                              */
/* 参数描述  : 延时时间数据                                                   */
/* 返回值    : 无                                                             */
/******************************************************************************/	
void delayt(uint x)
{
    uchar j;
    while(x-- > 0)
    {
  	    for(j = 0;j < 125;j++)
        {
            ;
        }
    }
}
/******************************************************************************/
/* 函数名称  : Init_MCU                                                       */
/* 函数描述  : 初始化单片机函数                                               */
/* 输入参数  : 无                                                             */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
void Init_MCU(void)
{
	
	//TMOD = 0x01;	  //定时器0初始化,设置为16位自动重装模式	与串口的TMOD配置重叠了
	
 	TL0 = 0xcd;
	TH0 = 0xf8;	      //1ms
    ET0 = 1;	      //开定时器0
	EA = 1;		      //总中断使能
}

/******************************************************************************/
/* 函数名称  : Init_Parameter                                                 */
/* 函数描述  : 初始化参数和IO口函数                                           */
/* 输入参数  : 无                                                             */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
void Init_Parameter(void)
{
	 OUTPUT =1;
	 INPUT = 1;
	 count = 0;
	 distance = 0;
}

/******************************************************************************/
/* 函数名称  : Trig_SuperSonic                                                */
/* 函数描述  : 发出声波函数                                                   */
/* 输入参数  : 无                                                             */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
void Trig_SuperSonic(void)//出发声波
{
	 OUTPUT = 1;
	 delayt(3);
	 OUTPUT = 0;
}

/******************************************************************************/
/* 函数名称  : Measure_Distance                                               */
/* 函数描述  : 计算距离函数                                                   */
/* 输入参数  : 无                                                             */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
void Measure_Distance(void)
{
	uchar l;
	uint h,y;
	uchar temp[5];
	TR0 = 1;
	while(INPUT)
	{
    ;
	}	
	TR0 = 0;
	l = TL0;
	h = TH0;
	y = (h << 8) + l;
	y = y - 0xf8cd;//us部分
	distance = y + 1000 * count;//计算总时间
	TL0 = 0xcd;
	TH0 = 0xf8;
	delayt(30);
	distance = VELOCITY_30C * distance / 20000;
   	memset(temp,0,sizeof(temp));
	sprintf(temp,"%d",distance);
	//UART1_Send_String("distance:");
//	UART1_Send_String(temp);
}

/******************************************************************************/
/* 函数名称  : main                                                           */
/* 函数描述  : 主函数                                                         */
/* 输入参数  : 无                                                             */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/					
void main(void)
{
	Init_MCU();
	Init_Parameter();
	UartInit();
	Delay_xMs(30000);
	while(1)
	{
		 Trig_SuperSonic();         //触发超声波发射
		 while(INPUT == 0)          //等待回声
     	{
        	;
     	}
		 Measure_Distance();        //计算脉宽并转换为距离
		 show();
		 UART1_Send_String("distance = ");
		 UART1_Send_String(a);
		 UART1_Send_String("\n");
		 Init_Parameter();          // 参数重新初始化
		 delayt(10);               //延时，两次发射之间要至少有10ms间隔
	 }	
}

/******************************************************************************/
/* 函数名称  : timer0                                                         */
/* 函数描述  : T0中断处理函数，                                                 */
/* 输入参数  : 无                                                             */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
void timer0 (void) interrupt 1
{
	TF0 = 0;
	TL0 = 0xcd;
	TH0 = 0xf8;
	count++;
	if(count == 36)//超声波回声脉宽最多18ms
	{
		TR0 =0;
		TL0 = 0xcd;
		TH0 = 0xf8;
		count = 0;
	}
}
/******************************************************************************/






