/******************************************************
//5-20:
(1)增加了超声波的测量.
(2)增加了PWM调制，可以改变电压，于LM298一起
//5-21：
(1)去掉PWM用定时器1控制LM298电压输出

*******************************************************/
#include	<config.h>
#include	<PWM.h>
 
/************************************宏定义************************************/
#define VELOCITY_30C	3495       //30摄氏度时的声速，声速V= 331.5 + 0.6*温度； 
#define VELOCITY_23C	3453       //23摄氏度时的声速，声速V= 331.5 + 0.6*温度； 

/************************************位定义************************************/
sbit INPUT  = P2^6;                //回声接收端口,
sbit OUTPUT = P2^7;                //超声触发端口
sbit led = P4^4;
/********************************定义变量和数组********************************/
long int distance=0;               //距离变量
uint count=0;
uint DPWM=1;
uchar TPWM=0;
unsigned char a[4];
uint DArray[10];
uint Dflag=0;

/**************************************/
void show()
{
	int ge,shi,bai;
	ge = distance%10;
	shi = distance/10%10;
	bai = distance/100%10;
	a[0] = distance/1000 +'0';
	a[1] = bai + '0';
	a[2] = shi + '0';
	a[3] = '\0';
}
/******************************************************************************/
/* 函数名称  : Delay_xMs                                                      */
/* 函数描述  : 延时函数                                                       */
/* 输入参数  : x                                                              */
/* 参数描述  : 延时时间                                                       */
/* 返回值    : 无                                                             */
/******************************************************************************/
void Delay_xMs(unsigned int x)
{
    unsigned int i,j;
    for(i = 0;i < x;i++ )
    {
        for(j = 0;j < 3;j++ )
        {
            ;
        }
    }
}	
/******************************************************************************/
/* 函数名称  : delayt                                                         */
/* 函数描述  : 延时函数                                                       */
/* 输入参数  : x                                                              */
/* 参数描述  : 延时时间数据                                                   */
/* 返回值    : 无                                                             */
/******************************************************************************/	
void delayt(uint x)
{
    uchar j;
    while(x-- > 0)
    {
  	    for(j = 0;j < 125;j++)
        {
            ;
        }
    }
}
/******************************************************************************/
/* 函数名称  : Init_MCU                                                       */
/* 函数描述  : 初始化单片机函数                                               */
/* 输入参数  : 无                                                             */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
void Init_MCU(void)
{
	
	//TMOD = 0x01;	  //定时器0初始化,设置为16位自动重装模式	与串口的TMOD配置重叠了	
 	TL0 = 0xcd;
	TH0 = 0xf8;	      //1ms
    ET0 = 1;	      //开定时器0
	EA = 1;		      //总中断使能
}

/******************************************************************************/
/* 函数名称  : Init_Parameter                                                 */
/* 函数描述  : 初始化参数和IO口函数                                           */
/* 输入参数  : 无                                                             */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
void Init_Parameter(void)
{
	 OUTPUT =1;
	 INPUT = 1;
	 count = 0;
	 distance = 0;
}

/******************************************************************************/
/* 函数名称  : Trig_SuperSonic                                                */
/* 函数描述  : 发出声波函数                                                   */
/* 输入参数  : 无                                                             */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
void Trig_SuperSonic(void)//出发声波
{
	 OUTPUT = 1;
	 delayt(3);
	 OUTPUT = 0;
}

/******************************************************************************/
/* 函数名称  : Measure_Distance                                               */
/* 函数描述  : 计算距离函数                                                   */
/* 输入参数  : 无                                                             */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
void Measure_Distance(void)
{
	uchar l;
	uint h,y;
	TR0 = 1;
	while(INPUT)
	{
    ;
	}	
	TR0 = 0;
	l = TL0;
	h = TH0;
	y = (h << 8) + l;
	y = y - 0xf8cd;//us部分
	distance = y + 1000 * count;//计算总时间
	TL0 = 0xcd;
	TH0 = 0xf8;
	delayt(30);
	distance = VELOCITY_30C * distance / 20000;
}

/******************************************************************************/
/* 函数名称  : main                                                           */
/* 函数描述  : 主函数                                                         */
/* 输入参数  : 无                                                             */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/					
void main(void)
{
	int Dtemp=0,i;
	char buff[10];
	Init_MCU();
	UartInit();
	PWMInit();
	Delay_xMs(30000);
	P4SW=0x70;
	P4 = 0;
	TR0 = 1;
	UART1_Send_String("bbbbb"); 
	while(1)
	{
		if(CCAP0H>220)
		{
			CCAP0H = 0;
		}
		if(CCAP0L>220)
		{
			CCAP0L = 0;
			sprintf(buff,"%d",CCAP0H);
			UART1_Send_String(buff);
		}		
		
	}	
}

/******************************************************************************/
/* 函数名称  : timer0                                                         */
/* 函数描述  : T0中断处理函数，                                                 */
/* 输入参数  : 无                                                             */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
void timer0 (void) interrupt 1
{
	TF0 = 0;
	TL0 = 0xcd;
	TH0 = 0xf8;
	count++;
	led = 0;
	if(count == 1000)//超声波回声脉宽最多18ms
	{
		led = 1;
		CCAP0L+=10;
		CCAP0H+=10;
		count = 0;
	}
}
/******************************************************************************/

/******************************************************************************/
/* 函数名称  : timer1                                                         */
/* 函数描述  : T1中断处理函数，                                                 */
/* 输入参数  : 无                                                             */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
void timer1 (void) interrupt 3
{
	TF1 = 0;	
	DPWM++;
	led = 0;
	if(DPWM > 1000)
	{ 
	}		
}
/******************************************************************************/






