/******************************************************
//5-20:
(1)增加了超声波的测量.
(2)增加了PWM调制，可以改变电压，于LM298一起
//5-21：
(1)去掉PWM用定时器1控制LM298电压输出

*******************************************************/
#include	<config.h>
#include	<PWM.h>
 
/************************************宏定义************************************/
#define VELOCITY_30C	3495       //30摄氏度时的声速，声速V= 331.5 + 0.6*温度； 
#define VELOCITY_23C	3453       //23摄氏度时的声速，声速V= 331.5 + 0.6*温度； 

/************************************位定义************************************/
sbit INPUT  = P2^6;                //回声接收端口,
sbit OUTPUT = P2^7;                //超声触发端口

/********************************定义变量和数组********************************/
long int distance=0;               //距离变量
uchar count=0;
uchar DPWM=1;
uchar TPWM=0;
unsigned char a[4];
uint DArray[10];
uint Dflag=0;

/**************************************/
void show()
{
	int ge,shi,bai;
	ge = distance%10;
	shi = distance/10%10;
	bai = distance/100%10;
	a[0] = distance/1000 +'0';
	a[1] = bai + '0';
	a[2] = shi + '0';
	a[3] = '\0';
}
/******************************************************************************/
/* 函数名称  : Delay_xMs                                                      */
/* 函数描述  : 延时函数                                                       */
/* 输入参数  : x                                                              */
/* 参数描述  : 延时时间                                                       */
/* 返回值    : 无                                                             */
/******************************************************************************/
void Delay_xMs(unsigned int x)
{
    unsigned int i,j;
    for(i = 0;i < x;i++ )
    {
        for(j = 0;j < 3;j++ )
        {
            ;
        }
    }
}	
/******************************************************************************/
/* 函数名称  : delayt                                                         */
/* 函数描述  : 延时函数                                                       */
/* 输入参数  : x                                                              */
/* 参数描述  : 延时时间数据                                                   */
/* 返回值    : 无                                                             */
/******************************************************************************/	
void delayt(uint x)
{
    uchar j;
    while(x-- > 0)
    {
  	    for(j = 0;j < 125;j++)
        {
            ;
        }
    }
}
/******************************************************************************/
/* 函数名称  : Init_MCU                                                       */
/* 函数描述  : 初始化单片机函数                                               */
/* 输入参数  : 无                                                             */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
void Init_MCU(void)
{
	
	//TMOD = 0x01;	  //定时器0初始化,设置为16位自动重装模式	与串口的TMOD配置重叠了	
 	TL0 = 0xcd;
	TH0 = 0xf8;	      //1ms
    ET0 = 1;	      //开定时器0
	EA = 1;		      //总中断使能
}

/******************************************************************************/
/* 函数名称  : Init_Parameter                                                 */
/* 函数描述  : 初始化参数和IO口函数                                           */
/* 输入参数  : 无                                                             */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
void Init_Parameter(void)
{
	 OUTPUT =1;
	 INPUT = 1;
	 count = 0;
	 distance = 0;
}

/******************************************************************************/
/* 函数名称  : Trig_SuperSonic                                                */
/* 函数描述  : 发出声波函数                                                   */
/* 输入参数  : 无                                                             */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
void Trig_SuperSonic(void)//出发声波
{
	 OUTPUT = 1;
	 delayt(3);
	 OUTPUT = 0;
}

/******************************************************************************/
/* 函数名称  : Measure_Distance                                               */
/* 函数描述  : 计算距离函数                                                   */
/* 输入参数  : 无                                                             */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
void Measure_Distance(void)
{
	uchar l;
	uint h,y;
	TR0 = 1;
	while(INPUT)
	{
    ;
	}	
	TR0 = 0;
	l = TL0;
	h = TH0;
	y = (h << 8) + l;
	y = y - 0xf8cd;//us部分
	distance = y + 1000 * count;//计算总时间
	TL0 = 0xcd;
	TH0 = 0xf8;
	delayt(30);
	distance = VELOCITY_30C * distance / 20000;
}

/******************************************************************************/
/* 函数名称  : main                                                           */
/* 函数描述  : 主函数                                                         */
/* 输入参数  : 无                                                             */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/					
void main(void)
{
	int Dtemp=0,i;
	Init_MCU();
	Init_Parameter();
	UartInit();
	PWMInit();
	Delay_xMs(30000);
	while(1)
	{
		 
		 Trig_SuperSonic();         //触发超声波发射
		 while(INPUT == 0)          //等待回声
     	 {
        	;
     	 }
		 Measure_Distance();        //计算脉宽并转换为距离
		 DArray[Dflag++] = distance;
		 delayt(10);               //延时，两次发射之间要至少有10ms间隔
		 if(Dflag==10)
		 {		 			 
			 distance = 0; //清零，然后当做平均值
			 Dflag = 0;	//记住有多少个数据被相加了
			 for(i=0;i<10;i++)
			 {
				distance+=DArray[i];			
			 }
			 distance/=10;
			 //setPWM(distance/100);		  
//			 switch(distance/100)			   //distance/100
//			 {
//			 	case 0:TPWM=3;break;	
//			 	case 1:TPWM=4;break;	
//				case 2:TPWM=5;break;
//				case 3:TPWM=6;break;
//				case 4:TPWM=7;break;
//				case 5:TPWM=10;break;
//				default :TPWM=10;
//			 }
			 switch(distance/100)			   //distance/100
			 {
			 	case 0:setPWM(1);break;	
			 	case 1:setPWM(2);break;	
				case 2:setPWM(3);break;
				case 3:setPWM(4);break;
				case 4:setPWM(4);break;
				case 5:setPWM(4);break;
				default :setPWM(4);
			 }
			 //UART1_Send_Byte(TPWM+'0');	
			 show();
			 UART1_Send_String("distance = ");
			 UART1_Send_String(a);
			 UART1_Send_String("\n"); 
		 }//判断10次接受完成
		 Init_Parameter();          // 参数重新初始化
		 
	 }	
}

/******************************************************************************/
/* 函数名称  : timer0                                                         */
/* 函数描述  : T0中断处理函数，                                                 */
/* 输入参数  : 无                                                             */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
void timer0 (void) interrupt 1
{
	TF0 = 0;
	TL0 = 0xcd;
	TH0 = 0xf8;
	count++;	
	if(count == 36)//超声波回声脉宽最多18ms
	{
		
		TR0 =0;
		TL0 = 0xcd;
		TH0 = 0xf8;
		count = 0;
	}
}
/******************************************************************************/

/******************************************************************************/
/* 函数名称  : timer1                                                         */
/* 函数描述  : T1中断处理函数，                                                 */
/* 输入参数  : 无                                                             */
/* 参数描述  : 无                                                             */
/* 返回值    : 无                                                             */
/******************************************************************************/
void timer1 (void) interrupt 3
{
	TF1 = 0;	
	DPWM++;
	if(DPWM == TPWM)
	{
		PWM=0;
	}	
	if(DPWM == 10)
	{
		DPWM =0;
		PWM=1;
	}
	
}
/******************************************************************************/






